"""Модуль main используется для запуска решеных тестовых заданий

Основное применение - импорт и запуск решеных заданий

Note:
    Возможны проблемы с кодировкой в Windows

Attributes
----------
file_path : str
    полный путь до текстового файла
lines : list
    список строк исходного файла

Methods
-------
load()
    Читает файл и сохраняет его в виде списка строк в lines
get_splitted(split_symbol=" ")
    Разделяет строки списка по указанному разделителю
    и возвращает результат в виде списка
"""


def main():
    pass


if __name__ == '__main__':
    main()
